app/controllers/ad_shopping_hists_controller.rb

  def show
    header_name_display
  	@ad_shopping_hist = ShoppingHistory.find(params[:id])
---
SELECT  "shopping_histories".* FROM "shopping_histories" WHERE "shopping_histories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]