app/controllers/ad_users_controller.rb

  def top
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @users = User.all
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "notice" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["notice", ""], ["updated_at", "2019-03-20 03:39:14.475973"], ["id", 1]]