app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def header_name_display
        if user_signed_in?
            @user = User.find(current_user.id)