app/controllers/infos_controller.rb

SELECT  "infomations".* FROM "infomations" WHERE "infomations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    header_name_display
    @infomation = Infomation.find(params[:id])