app/controllers/users_controller.rb

  def top
    @items = Item.all
    @infos = Infomation.all

  if user_signed_in?
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def mypage
    if user_signed_in?
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def show
    if user_signed_in?
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]