app/controllers/users/registrations_controller.rb

  def create
    @user = User.new(user_params)
    @user.save!
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "phone_number", "kanji_last", "kanji_first", "katakana_last", "katakana_first") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)